; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v5 - type_1 ?v2 - type_3)
 	      (pred_4 ?v3 - object ?v2 - type_3)
	      (pred_2 ?v5 - type_1 ?v6 - type_2)
	      (pred_3 ?v5 - type_1 ?v3 - object ?v6 - type_2))

   (:action op_2
       :parameters  (?v5 - type_1 ?v1 ?v7 - type_3)
       :precondition (and  (pred_1 ?v5 ?v1))
       :effect (and  (pred_1 ?v5 ?v7)
		     (not (pred_1 ?v5 ?v1))))

   (:action op_3
       :parameters (?v5 - type_1 ?v4 - object ?v8 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_4 ?v4 ?v8) (pred_1 ?v5 ?v8) (pred_2 ?v5 ?v6))
       :effect (and (pred_3 ?v5 ?v4 ?v6)
		    (not (pred_4 ?v4 ?v8)) 
		    (not (pred_2 ?v5 ?v6))))

   (:action op_1
       :parameters (?v5 - type_1 ?v4 - object ?v8 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v5 ?v4 ?v6) (pred_1 ?v5 ?v8))
       :effect (and (pred_4 ?v4 ?v8)
		    (pred_2 ?v5 ?v6)
		    (not (pred_3 ?v5 ?v4 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_1
obj_07 obj_08 - type_2
obj_05 obj_03 obj_01 obj_10 - type_3
obj_09 obj_02 obj_04 - object)
(:init
(pred_1 obj_06 obj_05)
(pred_2 obj_06 obj_07)
(pred_2 obj_06 obj_08)
(pred_4 obj_09 obj_05)
(pred_4 obj_02 obj_01)
(pred_4 obj_04 obj_05)
)
(:goal
(and
(pred_4 obj_09 obj_10)
(pred_4 obj_02 obj_03)
(pred_4 obj_04 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_06 ?b obj_07))))
)
)

; plan
1. (op_3 obj_06 obj_04 obj_05 obj_08)
   deleted: (pred_4 obj_04 obj_05) (pred_2 obj_06 obj_08)
   added: (pred_3 obj_06 obj_04 obj_08)
   goals met: 0 of 3
2. (op_2 obj_06 obj_05 obj_03)
   deleted: (pred_1 obj_06 obj_05)
   added: (pred_1 obj_06 obj_03)
   goals met: 0 of 3
3. (op_1 obj_06 obj_04 obj_03 obj_08)
   deleted: (pred_3 obj_06 obj_04 obj_08)
   added: (pred_4 obj_04 obj_03) (pred_2 obj_06 obj_08)
   goals met: 1 of 3
4. (op_2 obj_06 obj_03 obj_01)
   deleted: (pred_1 obj_06 obj_03)
   added: (pred_1 obj_06 obj_01)
   goals met: 1 of 3
5. (op_3 obj_06 obj_02 obj_01 obj_08)
   deleted: (pred_4 obj_02 obj_01) (pred_2 obj_06 obj_08)
   added: (pred_3 obj_06 obj_02 obj_08)
   goals met: 1 of 3
6. (op_2 obj_06 obj_01 obj_10)
   deleted: (pred_1 obj_06 obj_01)
   added: (pred_1 obj_06 obj_10)
   goals met: 1 of 3
7. (op_2 obj_06 obj_10 obj_03)
   deleted: (pred_1 obj_06 obj_10)
   added: (pred_1 obj_06 obj_03)
   goals met: 1 of 3
8. (op_1 obj_06 obj_02 obj_03 obj_08)
   deleted: (pred_3 obj_06 obj_02 obj_08)
   added: (pred_4 obj_02 obj_03) (pred_2 obj_06 obj_08)
   goals met: 2 of 3
9. (op_2 obj_06 obj_03 obj_10)
   deleted: (pred_1 obj_06 obj_03)
   added: (pred_1 obj_06 obj_10)
   goals met: 2 of 3
10. (op_2 obj_06 obj_10 obj_05)
   deleted: (pred_1 obj_06 obj_10)
   added: (pred_1 obj_06 obj_05)
   goals met: 2 of 3
11. (op_3 obj_06 obj_09 obj_05 obj_08)
   deleted: (pred_4 obj_09 obj_05) (pred_2 obj_06 obj_08)
   added: (pred_3 obj_06 obj_09 obj_08)
   goals met: 2 of 3
12. (op_2 obj_06 obj_05 obj_10)
   deleted: (pred_1 obj_06 obj_05)
   added: (pred_1 obj_06 obj_10)
   goals met: 2 of 3
13. (op_1 obj_06 obj_09 obj_10 obj_08)
   deleted: (pred_3 obj_06 obj_09 obj_08)
   added: (pred_4 obj_09 obj_10) (pred_2 obj_06 obj_08)
   goals met: 3 of 3
